# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs
#V2
# nc: 80
# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# backbone:
#   - [-1, 1, Conv,     [64, 3, 2]]
#   - [-1, 1, Conv,     [128, 3, 2, 1, 2]]
#   - [-1, 2, C3k2,     [256, False, 0.25]]      # giữ nguyên
#   - [-1, 1, Conv,     [256, 3, 2, 1, 4]]
#   - [-1, 2, C3k2,     [512, False, 0.25]]      # giữ nguyên
#   - [-1, 1, Conv,     [512, 3, 2]]
#   - [-1, 4, C2f_ECA,  [512, True, 1, 0.5]]     # thay ở tầng sâu
#   - [-1, 1, Conv,     [1024, 3, 2]]
#   - [-1, 4, C2f_ECA,  [1024, True, 1, 0.5]]    # thay ở tầng sâu

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]]
#   - [-1, 2, C2f, [512, False, 1, 0.5]]         # giữ nguyên

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]]
#   - [-1, 2, C2f, [256, False, 1, 0.5]]         # giữ nguyên

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 11], 1, Concat, [1]]
#   - [-1, 2, C2f, [512, False, 1, 0.5]]         # giữ nguyên

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 8], 1, Concat, [1]]
#   - [-1, 2, C3k2, [1024, True]]                # giữ nguyên

#   - [[14, 17, 20], 1, Detect, [nc]]


#V3
# YOLOv12 🚀, AGPL-3.0 license
# Stronger ECA variant

# nc: 80
# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# backbone:
#   - [-1, 1, Conv,     [64, 3, 2]]
#   - [-1, 1, Conv,     [128, 3, 2, 1, 2]]
#   - [-1, 2, C3k2,     [256, False, 0.25]]
#   - [-1, 1, Conv,     [256, 3, 2, 1, 4]]
#   - [-1, 2, C3k2,     [512, False, 0.25]]
#   - [-1, 1, Conv,     [512, 3, 2]]
#   - [-1, 4, C2f_ECA,  [512, True, 1, 0.5]]
#   - [-1, 1, Conv,     [1024, 3, 2]]
#   - [-1, 4, C2f_ECA,  [1024, True, 1, 0.5]]

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]]
#   - [-1, 2, C2f_ECA, [512, False, 1, 0.5]]

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]]
#   - [-1, 2, C2f, [256, False, 1, 0.5]]

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 11], 1, Concat, [1]]
#   - [-1, 2, C2f_ECA, [512, False, 1, 0.5]]

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 8], 1, Concat, [1]]
#   - [-1, 2, C3k2, [1024, True]]

#   - [[14, 17, 20], 1, Detect, [nc]]



#V4
# YOLOv12 + CoordAtt
# backbone sâu dùng C2f_CA, head cuối dùng C3k2_CA

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,    [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv,    [128, 3, 2, 1, 2]]       # 1-P2/4
  - [-1, 2, C3k2,    [256, False, 0.25]]      # 2
  - [-1, 1, Conv,    [256, 3, 2, 1, 4]]       # 3-P3/8
  - [-1, 2, C3k2,    [512, False, 0.25]]      # 4
  - [-1, 1, Conv,    [512, 3, 2]]             # 5-P4/16
  - [-1, 4, C2f_CA,  [512, True, 1, 0.5]]     # 6
  - [-1, 1, Conv,    [1024, 3, 2]]            # 7-P5/32
  - [-1, 4, C2f_CA,  [1024, True, 1, 0.5]]    # 8

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 9
  - [[-1, 6], 1, Concat, [1]]                    # 10
  - [-1, 2, C2f, [512, False, 1, 0.5]]           # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 4], 1, Concat, [1]]                    # 13
  - [-1, 2, C2f, [256, False, 1, 0.5]]           # 14

  - [-1, 1, Conv, [256, 3, 2]]                   # 15
  - [[-1, 11], 1, Concat, [1]]                   # 16
  - [-1, 2, C2f, [512, False, 1, 0.5]]           # 17

  - [-1, 1, Conv, [512, 3, 2]]                   # 18
  - [[-1, 8], 1, Concat, [1]]                    # 19
  - [-1, 2, C3k2_CA, [1024, True]]               # 20

  - [[14, 17, 20], 1, Detect, [nc]]